import 'package:flutter/material.dart';

class Australia extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Australia"),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(children: <Widget>[
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%8B%E0%B8%B4%E0%B8%94%E0%B8%99%E0%B8%B5%E0%B8%A2%E0%B9%8C-%E0%B9%82%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B8%A3%E0%B9%88%E0%B8%B2-%E0%B9%80%E0%B8%AE%E0%B8%B2%E0%B8%AA%E0%B9%8C01-800x531.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("โอเปร่าเฮาส์ (Sydney Opera House) หากถามว่าที่ไหนมีสถาปัตยกรรมที่สะท้อนวัฒนธรรมของออสเตรเลียได้ดีมากที่สุด เราขอยกให้ที่นี่ยืนหนึ่งไปเลย เพราะเขาได้รับการรับรองว่าเป็นมรดกโลกโดยยูเนสโกด้วยเมื่อปี 2550 ถึงแม้จะไม่ได้มีอายุเก่าแก่เท่ากับมรดกโลกอื่นๆก็ตาม ใครมาเยือนซิดนีย์จะพลาด โอเปร่าเฮาส์ ก็เหมือนมาไม่ถึงบ้านเขานั่นแหละ"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%AA%E0%B8%B0%E0%B8%9E%E0%B8%B2%E0%B8%99%E0%B8%AE%E0%B8%B2%E0%B8%A3%E0%B9%8C%E0%B9%80%E0%B8%9A%E0%B8%AD%E0%B8%A3%E0%B9%8C02-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("สะพานฮาร์เบอร์ เป็นสะพานโครงเหล็กรูปทรงโค้งขนาดมหึมาที่ทอดยาวเชื่อมเมืองฝั่งเหนือและฝั่งใต้ของซิดนีย์เข้าหากัน โดยสะพานแห่งนี้เป็นสัญลักษณ์อันน่าจดจำและภาพคุ้นตาของชาวโลกเมื่อนึกถึงออสเตรเลีย เนื่องจากเป็นจุดที่มีการจุดพลุในคืนส่งท้ายปีอย่างเป็นประจำ ทำให้นักท่องเที่ยวต่างพากันเดินทางมาถ่ายรูปและเก็บภาพที่ระลึกกันอย่างไม่ขาดสายตลอดทั้งปี เพราะนอกจากจะได้รูปที่สวยงามกลับไปแล้ว ยังสามารถมาชมบรรยากาศเมืองรอบๆ ได้อย่างเต็มที่อีกเช่นกัน"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/Taronga-Zoo-01-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("Taronga Zoo เป็นสวนสัตว์ที่เรียกได้ว่าเป็นที่เที่ยวออสเตรเลียสุดฮิตสำหรับครอบครัว โดยเฉพาะน้องๆ หนูๆ ที่ชื่นชอบความน่ารักของสัตว์น้อยต่างๆ โดยภายในมีสัตว์มากกว่า 4,000 ตัว ซึ่งไฮไลท์เด็ดของสวนสัตว์แห่งนี้ก็คือ เจ้าหมีโคอาลาและจิงโจ้ ที่นับว่าเป็นพระเอกและสัญลักษณ์ที่สำคัญของออสเตรเลียเลยก็ว่าได้ นอกจากนี้ยังมีสัตว์สายพันธุ์แปลกๆ จำนวนมากมายให้นักท่องเที่ยวได้ชื่นชมกันอีกด้วย ไม่ว่าจะเป็น หมีหมา จระเข้น้ำจืด และสิงโตแอฟริกา เป็นต้น โดยกิจกรรมที่พลาดไม่ได้เลยก็คือ การให้อาหารสัตว์และถ่ายรูปเป็นที่ระลึกกับน้องๆ อย่างใกล้ชิดนั่นเอง"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B9%82%E0%B8%82%E0%B8%94%E0%B8%AB%E0%B8%B4%E0%B8%99%E0%B8%AD%E0%B8%B8%E0%B8%A5%E0%B8%B9%E0%B8%A3%E0%B8%B902-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("สำหรับใครที่เป็นนักท่องเที่ยวสายธรรมชาติก็ควรไม่พลาดกับการไปเช็คอินกันที่เที่ยวออสเตรเลียอย่าง โขดหินอุลูรู ที่มีลักษณะโดดเด่นและสวยงามอย่างสะดุดตา โดยขูดหินนี้จริงๆ แล้วเป็นแหล่งที่อยู่อาศัยของประชากรค้างคาว และสัตว์เลื้อยคลานอื่นๆ มากกว่า 73 สายพันธุ์ รวมไปถึงสัตว์เลี้ยงลูกด้วยนมหลากหลายชนิดที่ต่างอาศัยอยู่บริเวณขูดหินเหล่านี้ ไม่ว่าจะเป็น วัลลาบี้กระต่ายสีน้ำตาลแดง ตุ่นมีถุงหน้าท้อง หรือจิ้งเหลนทะเลทรายยักษ์ เป็นต้น"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/Bathing-Box02-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ที่เที่ยวออสเตรเลียอย่าง Bathing Box นับเป็นจุดเช็คอินยอดนิยมของเมืองเมลเบิร์น ที่นักท่องเที่ยวต้องมาถ่ายรูปกันให้ได้ เนื่องจาก Bathing Box แห่งนี้นี้เป็นเคบินเปลี่ยนเสื้อผ้า ที่ตั้งเรียงรายอยู่บนหาด Brighton จำนวนกว่า 82 เคบิน ซึ่งแต่ละอันก็มีการตกแต่งลวดลายที่แตกต่างกันไป ทำให้นักท่องเที่ยวที่เดินทางมาสามารถเลือกแบบที่ตนเองชอบและต้องการได้ รับรองว่าคุณจะได้รูปกลับไปอัพลงไอจีไม่ซ้ำมุมใครอย่างแน่นอน"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B9%80%E0%B8%81%E0%B8%B2%E0%B8%B0%E0%B8%9F%E0%B8%B4%E0%B8%A5%E0%B8%A5%E0%B8%B4%E0%B8%9B-01-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("เกาะฟิลลิป แหล่งท่องเที่ยวเชิงธรรมชาติที่ใครมาถึงออสเตรเลียก็ไม่ควรพลาด เพราะเกาะแห่งนี้ขึ้นได้ชื่อว่าเป็นเกาะที่มีความสมบูรณ์แบบของธรรมชาติเป็นอย่างมาก เพราะนอกจากคุณจะได้ชมวิวทิวทัศน์ที่สวยงาม และฟังเสียงของคลื่นที่กระทบเข้าข้างฝั่งอย่างเพลิดเพลินแล้ว คุณยังจะได้พบกับสัตว์ทะเลน้อยน่ารักๆ อีกด้วย ไม่ว่าจะเป็น หมีโคอาล่า แพนกวินตัวน้อย และสัตว์อื่นๆ อีกมากมาย และที่สำคัญยังเป็นสถานที่ที่เหมาะแก่การมาโพสท่าถ่ายกันสวยๆ กันบริเวณริมชายหาดอีกด้วย"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%AB%E0%B8%B2%E0%B8%94%E0%B8%9A%E0%B8%AD%E0%B8%99%E0%B9%84%E0%B8%94-01-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("หาดบอนได ที่เที่ยวออสเตรเลีย เป็นอีกหนึ่งหาดที่มีชื่อเสียงโด่งดังระดับโลก เนื่องจากหาดทรายสีขาวและน้ำทะเลสีฟ้าใสที่ใครเห็นแล้วก็ต้องตกหลุมรักอย่างแน่นอน โดยกิจกรรมหลักๆ ที่เป็นที่นิยมก็จะเป็นการว่ายน้ำกลางทะเลท่ามกลางบรรยากาศสุดชิล เล่นเซิร์ฟอย่างสนุกสนาน และนอนอาบแดดบริเวณริมหาดเพื่อเป็นการพักผ่อนกันนั่นเอง อีกทั้งบริเวณโดยรอบยังมีร้านค้า สถาปัตยกรรมอันสวยงาม ร้านอาหาร คาเฟ่น่านั่ง และบาร์อีกมากมายให้นักท่องเที่ยวได้แวะเวียนกันเข้ามา และที่สำคัญจุดไฮไลท์ที่คุณไม่ควรพลาดเลยก็คือ Bondi Icebergs ซึ่งเป็นสระว่ายน้ำติดทะเลที่ผู้คนต่างให้ความสนใจกันเป็นจำนวนมาก หากใครมีโอกาสได้ไปแล้วก็อย่าลืมแวะไปเช็คอินกันได้"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%9E%E0%B8%B4%E0%B8%9E%E0%B8%B4%E0%B8%98%E0%B8%A0%E0%B8%B1%E0%B8%93%E0%B8%91%E0%B9%8C%E0%B8%A8%E0%B8%B4%E0%B8%A5%E0%B8%9B%E0%B8%B0-%E0%B8%99%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%8B%E0%B8%B2%E0%B8%97%E0%B9%8C%E0%B9%80%E0%B8%A7%E0%B8%A5%E0%B8%AA%E0%B9%8C01-800x530.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ที่เที่ยวออสเตรเลียอย่าง พิพิธภัณฑ์ศิลปะ นิวเซาท์เวลส์ เป็นสถานที่จัดแสดงงานศิลปะของซิดนีย์ที่ได้นำเสนองานนิทรรศการอันหลากหลายรูปแบบที่น่าสนใจให้แก่สาธารณชนโดยไม่ต้องเสียค่าใช้จ่ายใดๆ ทั้งสิ้น ซึ่งภายในได้มีการรวบรวมทั้งงานศิลปะของชาวออสเตรเลียในยุคต้น ศิลปะของชาวอะบอริจินและของชาวเกาะช่องแคบตอร์เรสเข้าไว้ด้วยกัน ทำให้นักท่องเที่ยวสามารถเดินเยี่ยมชมกันได้อย่างเต็มที่ อีกทั้งยังมีในส่วนบริเวณของร้านกาแฟและร้านอาหารไว้สำหรับผู้ที่ต้องการผ่อนคลายความเหนื่อยล้าจากการเดินทางและจิบกาแฟเบาๆ พร้อมสัมผัสบรรยากาศภายในได้อย่างเต็มเปี่ยม"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%99%E0%B9%80%E0%B8%94%E0%B8%AD%E0%B8%B0%E0%B8%A3%E0%B9%87%E0%B8%AD%E0%B8%84%E0%B8%AA%E0%B9%8C-01-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ย่านเดอะร็อคส์เป็นย่านเก่าแก่แห่งหนึ่งของออสเตรเลียที่เต็มไปด้วยมนต์เสน่ห์อันน่าค้นหา เนื่องจากเป็นชุมชนที่ชาวยุโรปได้เข้ามาตั้งถิ่นฐานเมื่อ 200 ปีที่ผ่านมา ทำให้ย่านแห่งนี้เป็นที่เที่ยวออสเตรเลียที่คงซึ่งความโบราณสไตล์ยุโรปเอาไว้ โดยในปัจจุบันก็ได้มีการปรับเปลี่ยนเป็นร้านอาหาร คาเฟ่ และแหล่งช็อปปิ้งแบบวอล์คกิ้งสตรีทต่างๆ มากมาย รวมไปถึงสินค้างานดีไซน์และของที่ระลึกที่มีรูปแบบไม่ซ้ำใคร ไม่ว่าจะเป็น บูมเมอแรง ภาพวาด ของตกแต่งบ้านสุดเก๋ โปสการ์ด และอื่นๆ อีกมากมาย ซึ่งหากใครไม่รู้ว่าจะซื้ออะไรไปฝากคนที่บ้านก็สามารถมาเดินดูของที่ย่านแห่งนี้ได้"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://blog.traveloka.com/th/wp-content/uploads/sites/5/2019/11/%E0%B8%95%E0%B8%B6%E0%B8%81%E0%B8%84%E0%B8%A7%E0%B8%B5%E0%B8%99%E0%B8%A7%E0%B8%B4%E0%B8%81%E0%B8%95%E0%B8%AD%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A201-800x534.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ตึกควีนวิกตอเรีย เป็นที่เที่ยวออสเตรเลียที่เป็นอาคารเก่าแก่และมีอายุมากกว่า 100 ปี ซึ่งภายในเป็นแหล่งช้อปปิ้งเซนเตอร์ใจกลางเมืองที่มีด้วยกันถึง 4 ชั้นลอย และ 2 ชั้นใต้ดิน ทำให้ชาวออสเตรเลียและนักท่องเที่ยวต่างพากันเดินทางมาเดินเล่น จับจ่ายใช้สอย และใช้เวลากับครอบครัวในวันหยุดกันอย่างเพลิดเพลิน เนื่องจากด้านในตึกควีนวิกตอเรียแห่งนี้เต็มไปด้วยร้านค้าและร้านอาหารต่างๆ มากมาย อีกทั้งยังมีความโดดเด่นในเรื่องของสถาปัตยกรรมอีกด้วย เรียกได้ว่าใครเป็นสายช้อปก็ไม่ควรพลาดกับการเดินทางมาปักหมุดและเดินเล่นกันแบบคูลๆ นั่นเอง"),
            ),
            
          ]),
        ),
      ),
    );
  }
}


