import 'package:flutter/material.dart';

class Korea extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Korea"),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(children: <Widget>[
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/c6874abf-7c65-4256-86ea-dd3438f527e2.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("พระราชวังเคียงบกกุง สำหรับสายพีเรียด คนที่ชอบแนวประวัติศาสตร์ สถาปัตยกรรม ความสวยงาม อลังการ เราชวนให้ไปเที่ยวที่ พระราชวังเคียงบกกุง สักครั้ง ที่นี่เป็นพระราชวังที่มีขนาดใหญ่ และเก่าแก่ที่สุดในกรุงโซล สร้างขึ้นในปี 1394 ในสมัยพระเจ้าแทโจ ราชวงศ์โชซอนค่ะ อีกทั้งยังเป็นทั้งสัญลักษณ์ และแหล่งท่องเที่ยวยอดฮิตของกรุงโซลอีกด้วย"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/c19d9a47-8531-4ae1-890d-ad33ff09574c.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("หมู่บ้านบุกชอนฮันอก  ซึ่งเป็นหมู่บ้านโบราณที่ยังคงอนุรักษ์บ้านเรือน อาคารต่างๆ ในสมัยโบราณไว้ มาเดินเล่นที่นี่ทำให้รู้สึกเหมือนได้ย้อนกลับไปในยุคสมัยที่โซชอนนั้นยังคงความรุ่งเรืองอยู่เลยทีเดียว ภายในหมู่บ้านจะได้เจอกับบ้านขุนนางระดับสูงของเกาหลีในสมัยก่อนกว่า 100 หลัง เกสต์เฮ้าส์ ร้านอาหาร และโรงน้ำชา เรียกได้ว่า เดินเพลินถ่ายรูปสวยไปได้เลยค่ะ ถ้าเช่าชุดฮันบกมาใส่เดินเล่นไปด้วย ยิ่งบอกเลยว่าฟิน! คนที่ชอบแนวประวัติศาสตร์ก็พลาดไม่ได้เหมือนกันนะ เพราะที่นี่ถือว่าเป็นอีกแลนด์มาร์คนึงของกรุงโซลเลยทีเดียว"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/b08ab42a-3f34-4a4f-a801-dd5713443d7a.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("สวนสนุกล็อตเต้ เวิลด์ สายสวนสนุกต้องกรี๊ด เพราะเรากำลังจะพามารู้จักกับ สวนสนุกล็อตเต้ เวิลด์ สวนสนุกชื่อดังของเกาหลีที่ รวบรวมเครื่องเล่นสนุกๆ ไว้เพียบ และจะมีตัวการ์ตูนแรคคูน ที่มีชื่อว่า Lotty และ Lorry ซึ่งเป็นสัญลักษณ์ของที่นี่อยู่ทุกแห่งในสวนสนุกล็อตเต้ น่ารักมากๆ เลยค่ะ"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/01ff53ac-2af7-42e2-ae21-9ad0637dfbe1.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("สวนสนุกเอเวอร์แลนด์ อีกหนึ่งสวนสนุกระดับโลก และยังถือว่าเป็นสวนสนุกกลางแจ้งที่ใหญ่ที่สุดในเกาหลีภอีกด้วยค่ะ ภายในมีทั้ง เครื่องเล่นมากมาย มีสวนดอกไม้นานาชาติที่มีให้ชมตลอดทั้งปี และสำหรับคนรักสัตว์ห้ามพลาด เพราะที่นี่ยังมีสวนสัตว์ซาฟารีขนาดใหญ่รวมอยู่อีกด้วยจ้า"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/cadd792a-91bc-4843-868b-e81e38a0d469.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ย่านเมียงดง เป็นแหล่งช้อปปิ้งยอดฮิตใจกลางกรุงโซลที่ใครๆ ก็รู้จัก แน่นอนว่าขาช้อปต้องไม่พลาดที่จะไปเช็คอินที่นี่ ด้านในเต็มไปด้วย ร้านเสื้อผ้าแฟชั่น ร้านอาหาร ร้านเครื่องสำอาง ร้านขายเครื่องประดับ ห้างต่างๆ รวมถึงสตรีทฟู้ด ที่จะมีเหล่าพ่อค้า แม่ค้ามาตั้งแผงขายอาหารอร่อย น่ากินอยู่เพียบ ช้อปปิ้งไปด้วย เดินกินของอร่อยไปด้วย โอ้ยยย ฟินไป !"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/bf830e69-c9b0-4eda-a10e-edc7a11b27ec.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("อุโมงค์ซากุระ คลองยอชวาชอน เป็นอีกที่ถ่ายรูปสวยของเกาหลี โดยเฉพาะในช่วงฤดูใบไม้ผลิที่มีซากะระบาน ที่นี่จะกลายเป็นที่เที่ยวยอดฮิตในช่วงเทศกาลชมดอกซากุระ และมีจุดชมซากุระที่สวยงามมากๆ ค่ะ นอกจากชมดอกไม้บนสะพานแล้ว เรายังสามารถเดินเล่นได้ทั้งด้านบนสะพานและด้านล่างอีกด้วย ซึ่งจะมีทางเท้ายาวตลอดแนวเรียบไปกับคลอง รวมถึงยังมีการนำร่มมาประดับ และเปิดไฟสวยๆ ในตอนกลางคืนอีกด้วยค่ะ"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/6d98b7a4-0ba1-4f6a-bb3a-f4ce56628fad.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("อุทยานแห่งชาติฮัลลาซาน  อีกที่เที่ยวธรรมชาติที่น่าประทับใจ เหมาะสำหรับคนชอบธรรมชาติ และเดินป่า ต้องมาเที่ยวที่ อุทยานแห่งชาติฮัลลาซาน ซึ่งตั้งอยู่ใจกลางเกาะเชจูค่ะ และที่นี่ได้รับการขึ้นทะเบียนเป็นมรกดกโลกอีกด้วย กิจกรรมที่นักท่องเที่ยวมาเที่ยวที่นี่ก็คือ การปีนเขา เพราะเส้นทางสำหรับเดินนี้เป็นเส้นทางที่ไม่ยากนัก ระยะทางไม่เกิน 10 กิโลเมตร ทำให้สามารถขึ้นไปยังจุดสูงสุดของยอดเขาฮัลลาซาน และเดินกลับได้ภายในวันเดียว"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/1bc14422-3e23-4008-a0d4-47abb995deb9.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("อุทยานแห่งชาติแดดุนซาน เป็นอุทยานฯ อีกแห่งที่มีชื่อเสียงมากๆ โดยเฉพาะในช่วงฤดูใบไม้ร่วง ทั่วทั้งหุบเขาจะเต็มไปด้วยใบไม้เปลี่ยนสีหลากหลายสีสัน ทั้ง แดง ส้ม เหลือง อีกทั้งยังมียอดเขารูปทรงแปลกตา และถ้ำชื่อดังต่างๆ มากมาย "),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/c31ac90c-3334-4f98-88fc-de8d5ea6e5cf.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ทางรถไฟดอกซากุระคยองฮวา ซากุระที่เกาหลีก็สวยไม่แพ้ที่ไหน โดยเฉพาะที่นี่ ทางรถไฟดอกซากุระคยองฮวา หนึ่งในจุดชมซากุระที่สวยอันดับต้นๆ ของเกาหลีค่ะ แน่นอนว่าไฮไลท์ของที่นี่ก็คือ อุโมงค์ดอกซากุระที่พร้อมใจกันผลิบานในช่วงเดือนเมษายน และมีรถไฟวิ่งผ่าน ซึ่งจะมองเห็นวิวสวยๆ ของดอกซากุระเป็นฉากหลังด้วยค่ะ"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2018/11/13/25011a1e-09b6-4ac5-8413-704e7acde28f.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ลานชองกเยพลาซ่า ตั้งอยู่บนถนนเซจอง (Sejong-ro) เป็นแหล่งพักผ่อนย่อนใจของคนในกรุงโซล โดยเริ่มตั้งแต่ต้นคลองชองกเยชอนยาวไปจนถึงสะพานซินทับชอลกโย (Sindapcheolgyo Bridge) ระยะทางยาวประมาณ 160 เมตร สิ่งที่น่าสนใจก็คือ ลานน้ำพุ Candlelight Fountain ที่มีความยาวประมาณ 4 เมตร เป็นน้ำพุเล่นระดับสองชั้น ในตอนเวลากลางคืนนั้น จะมีการเปิดไฟประดับหลายสีสันที่สวยงามมากๆ เหมาะกับการมาถ่ายรูปสวยๆ มากทีเดียว"),
            ),
            
          ]),
        ),
      ),
    );
  }
}


