import 'package:flutter/material.dart';

class Thai extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Thai"),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(children: <Widget>[
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/dbdabd7b-cbd8-4f36-b4f1-05fd51055d0c.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("วัดคู่บ้านคู่เมืองของประเทศไทย และกรุงรัตนโกสินทร์ ก็คือที่นี่ค่ะ วัดพระศรีรัตนศาสดาราม หรือ วัดพระเเก้ว เป็นวัดในพระบรมมหาราชวังเช่นเดียวกับวัดพระศรีสรรเพชญ์ ซึ่งเป็นวัดในพระราชวังหลวงในสมัยอยุธยา นอกจากนี้ภายในวัดพระศรีรัตนศาสดารามเป็นที่ประดิษฐาน พระพุทธมหามณีรัตนปฏิมากร หรือพระแก้วมรกต ที่นำมาจากกรุงเวียงจันทน์ เป็นวัดหลวงที่สำคัญในพระราชพิธีต่างๆ และยังเป็นแหล่งท่องเที่ยวที่สำคัญของประเทศไทยเราอีกด้วย"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/777c82fa-272f-43e7-806a-8d53a582e232.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("หลายคนอาจจะไม่เชื่อเพราะติดภาพความแห้งแล้งของอีสานเข้าไป ก็ไว้จนคิดว่าอีสานต้องร้อนและแล้งสุดๆ แต่ขอบอกว่า เดี๋ยวนี้เขาพัฒนาแล้ว ! ใครจะไปเชื่อว่าอีสานใต้ จะมีเที่ยวชมดอกไม้เมืองหนาว แต่ก็มีอยู่จริงๆ ที่ เพลาเพลิน บุรีรัมย์ ค่ะ ที่นี่หลักๆ แล้วสร้างขึ้นเพื่อเป็นสถานที่เพื่อพัฒนาผู้เรียนนอกห้องเรียนสำหรับเยาวชน และบุคคลทั่วไป นอกจากนี้อุทยานไม้ดอกเพลาเพลินก็จะมีเรือนจัดแสดงพืชพันธุ์นานาชนิดอีกด้วย"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/2699f5f3-eefc-4b76-8dd3-8133b4873d15.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("หมู่เกาะกำ นั้น เป็นหมู่เกาะที่อยู่ในพื้นที่ของอุทยานแห่งชาติแหลมสน ที่นี่เป็นหมู่เกาะที่มีความสวยงาม น้ำทะเลใส และหาดทรายขาว เป็นจุดดำน้ำตื้น, เล่นน้ำ ของเหล่านักท่องเที่ยวอีกแห่งหนึ่งค่ะ ซึ่งสามารถไปเที่ยวที่นี่ได้ด้วยโปรแกรมนำเที่ยวหมู่เกาะกำแบบไปเช้าเย็นกลับ สามารถเช่าเหมาเรือหางยาวของชาวบ้าน ติดต่อขอเช่าเรือได้ที่ชมเรือนำเที่ยวค่ะ ชมเรือนำเที่ยว โทร.08-6271-0373"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/73512677-71cf-4649-9b4d-ca4b47d2587e.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ต้องบอกว่าหนึ่งปีมีแค่ครั้งเดียวเท่านั้นกับการอวดโฉมของซากุระญี่ปุ่น ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ที่ สถานีเกษตรหลวงอ่างขาง ต้นซากุระญี่ปุ่น และ เชอรี่ (Cherry Blossom) ซึ่งมูลนิธิโครงการหลวงได้นำเข้ามาปลูกทั้งจากญี่ปุ่น และไต้หวันนั้น บานสะพรั่งสีชมพูสวยไปทั้งอ่างขางกว่า 5,000 ต้นแล้วค่ะ นักท่องเที่ยวสามารถเดินชมได้ตามจุดต่างๆ ได้"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/73b05b6c-d3b6-4808-8a69-426b15b56fac.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ภูชี้ฟ้า เป็นยอดเขาสูงที่สุดในเทือกเขาดอยผาหม่น ติดชายแดนไทย-ลาว ค่ะ ตั้งอยู่ในอำเภอเทิง จังหวัดเชียงราย ด้วยความมีเอกลักษณ์ทางธรรมชาติของลักษณะหน้าผาปลายยอดแหลม เป็นแนวยาวที่ชี้ไปบนฟ้าทางฝั่งประเทศลาว จึงเป็นที่มาของชื่อเรียกว่า “ภูชี้ฟ้า” นั่นเอง"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/450b8d04-3902-4fa7-9696-4c8e2aecc137.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("เมื่อมาถึง กาญจนบุรี หนึ่งในจุดท่องเที่ยวที่เรานึกถึงเป็นลำดับต้นๆ คงหนีไม่พ้นก็คือ สะพานข้ามแม่น้ำแคว ทางรถไฟที่ดูแข็งแกร่ง ทอดตัวยาวข้ามแม่น้ำประมาณ 300 เมตร แลนด์มาร์คของเมืองกาญจน์ เป็นส่วนหนึ่งของเส้นทางรถไฟในช่วงสงครามโลกครั้งที่ 2 เพื่อให้ได้มาซึ่งทางรถไฟที่มีความยาวถึง 415 กิโลเมตร เริ่มต้นจากสถานีชุมทางหนองปลาดุก จ.ราชบุรี ไปสู่ปลายทางที่เมืองทันบูซายัค ประเทศเมียนมาร์"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/4f35ef7e-f800-4424-86f0-4d4cfa7b08cf.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("เกาะหวาย อยู่ห่างจากเกาะช้างเพียง 40 นาที สามารถขึ้นเรือได้ที่ท่าเรือบางเบ้าบนเกาะช้าง หรือจะขึ้นมาจากอ.แหลมงอบ (ท่าเรือกรมหลวงชุมพร) ก็ได้ ต้องบอกก่อนว่าถ้าอยากจะเห็นปะการังสีสวยๆ สดๆ จะต้องออกไปไกลจากหาดสักหน่อย ส่วนใหญ่จะเป็นปะการังเขากวาง และปะการังพุ่ม แต่จะต้องระวังหอยเม่นด้วยเพราะบริเวณนี้ค่อนข้างจะชุกชุม แต่ก็เป็นสิ่งยืนยันความสมบูรณ์ของท้องทะเลที่นี่ได้เป็นอย่างดีค่ะ"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/6f33305b-7d50-43da-b76d-0367ac5fb5eb.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ใครว่าทะเลทางใต้มีแต่น้ำเค็ม เราอยากจะชวนเพื่อนๆ ไปนั่งเล่น แพริมน้ำ พายเรือคายัคชมวิวยังที่ที่ได้รับการขนานนามให้เป็นกุ้ยหลินเมืองไทย ที่ เขื่อนรัชชประภา หรือ เขื่อนเชี่ยวหลาน อยู่ในอุทยานแห่งชาติเขาสก จังหวัดสุราษฎร์ธานี ใครที่อยากตื่นตอนเช้าแล้วเห็นทะเลหมอกกลางภูเขาหินปูน ไม่ควรพลาดที่พักเหล่านี้เด็ดขาด"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/58218a99-7f85-4cd8-9fa3-6f366fba7dc0.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("ใครกำลังอยากไปชมซากุระเมืองไทย หรือ ต้นนางพญาเสือโคร่ง ดอกสีชมพู บานสะพรั่งไปทั่วทั้งขุนเขา แล้วล่ะก็ ต้องไปพลาดไปเที่ยวที่นี่ค่ะ “ภูลมโล” อ.ด่านซ้าย จ.เลย ที่นี่เป็นแหล่งท่องเที่ยวเชิงอนุรักษ์ธรรมชาติแห่งใหม่ ที่มีต้นนางพญาเสือโคร่งกว่า 100,000 ต้น ในพื้นที่รวมประมาณ 1,000 ไร่ทีเดียว และได้เปิดให้นักท่องเที่ยวเข้าชมอีกด้วย"),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 7,left: 7,right: 7),
              child: Image.network('https://cms.dmpcdn.com/travel/2017/08/03/1b3472eb-6d0a-4e03-b53e-7882639f6aed.jpg')
            ),
            Padding(
              padding: const EdgeInsets.all(14.0),
              child: Text("หน้าหนาวในไทย นอกจากการไปนอนกางเต้นท์ ดูทะเลหมอก หรือ ดูดอกไม้เมืองหนาวบานสะพรั่ง อีกสิ่งหนึ่งที่พลาดไม่ได้เลยก็คือการไปชิมสตรอว์เบอร์รี่สดๆ จากไร่ และที่ ‘เชียงใหม่’ ก็เป็นจังหวัดที่มีไร่สตรอว์เบอร์รี่มากมาย ให้เราได้เลือกไปชม ชิม ช้อปกันอย่างจุใจเลยค่ะ"),
            ),
            
          ]),
        ),
      ),
    );
  }
}


